---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RampAttrRightBalusterAttachPt
source: html/f8f2ed44-96f9-2cde-c54f-b960bac64b07.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RampAttrRightBalusterAttachPt Property

"Right Baluster Location"

## Syntax (C#)
```csharp
public static ForgeTypeId RampAttrRightBalusterAttachPt { get; }
```